<?php

use Illuminate\Support\Facades\Schema;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;

class InitialBaseSite extends Migration
{

    protected $user_table = "user";
    protected $store_table = "store";
    protected $option_table = "option";
    protected $role_table = "role";
    protected $service_table = "service";
    protected $user_role_table = "user_role_relation";
    protected $role_service_table = "role_service_relation";
    protected $service_user_table = "service_user_relation";

    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        
        // 建立初始table

        // user

        Schema::create($this->user_table, function (Blueprint $table) {
            $table->increments('id');
            $table->string('account')->unique();
            $table->string('password');
            $table->string('real_name');
            $table->string('mobile');
            $table->string('photo')->default('');
            $table->integer('parents_id')->default(0);
            $table->integer('status')->index();
            $table->integer('is_free')->default(1);
            $table->timestamps();
            $table->engine = 'InnoDB';
        });

        // store

        Schema::create($this->store_table, function (Blueprint $table) {
            $table->increments('id');
            $table->integer('user_id')->unsigned();
            $table->string('store_name');
            $table->string('store_code')->unique();
            $table->integer('store_type');
            $table->date('deadline');
            $table->integer('is_free')->default(1);
            $table->timestamps();
            $table->engine = 'InnoDB';
        });

        Schema::table($this->store_table, function($table) {
           $table->foreign('user_id')->references('id')->on('user');
        });

        // option type - 1 store_type,99: free_use_for_key_value

        Schema::create($this->option_table, function (Blueprint $table) {
            $table->increments('id');
            $table->integer('type');
            $table->string('key')->unique();
            $table->text('value');
            $table->integer('parents_id');
            $table->integer('status');
            $table->timestamps();
            $table->engine = 'InnoDB';
        });

        // role

        Schema::create($this->role_table, function (Blueprint $table) {
            $table->increments('id');
            $table->string('name');
            $table->integer('status')->index();
            $table->timestamps();
        });

        // service

        Schema::create($this->service_table, function (Blueprint $table) {
            $table->increments('id');
            $table->string('name');
            $table->string('link');
            $table->integer('parents_id');
            $table->integer('status')->index();
            $table->integer('public')->default(2);
            $table->integer('sort');
            $table->timestamps();
        });

        // user_role

        Schema::create($this->user_role_table, function (Blueprint $table) {
            $table->increments('id');
            $table->integer('user_id')->unsigned();
            $table->integer('role_id')->unsigned();
        });

        Schema::table($this->user_role_table, function($table) {
           $table->foreign('user_id')->references('id')->on('user');
           $table->foreign('role_id')->references('id')->on('role');
        });

        // role_service

        Schema::create($this->role_service_table, function (Blueprint $table) {
            $table->increments('id');
            $table->integer('role_id')->unsigned();
            $table->integer('service_id')->unsigned();
        });

        Schema::table($this->role_service_table, function($table) {
           $table->foreign('role_id')->references('id')->on('role');
           $table->foreign('service_id')->references('id')->on('service');
        });

        // service_user

        Schema::create($this->service_user_table, function (Blueprint $table) {
            $table->increments('id');
            $table->integer('service_id')->unsigned();
            $table->integer('user_id')->unsigned();
        });

        Schema::table($this->service_user_table, function($table) {
           $table->foreign('service_id')->references('id')->on('service');
           $table->foreign('user_id')->references('id')->on('user');
        });


        // 寫入基本資料

        // user
        DB::table($this->user_table)->insert(
            array(
                'account'       => 'admin@base.com',
                'password'      => Hash::make('123456'),
                'real_name'     => '系統管理員',
                'mobile'        => '0900123456',
                'parents_id'    => 0,
                'status'        => 1,
                'is_free'       => 1,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );

        // store
        DB::table($this->store_table)->insert(
            array(
                'user_id'       => 1,
                'store_name'    => 'Coo管理者',
                'store_code'    => 'ADM',
                'store_type'    => 2,
                'deadline'      => "2050-12-31",
                'is_free'       => 1,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );

        // store_type

        $store_type = array(
                            "A" => array(
                                        "name" => "農、林、漁、牧業",
                                        "data" => array(
                                                        "0111" => "稻作栽培業",
                                                        "0112" => "雜糧栽培業",
                                                        "0113" => "特用作物栽培業",
                                                        "0114" => "蔬菜栽培業",
                                                        "0115" => "果樹栽培業",
                                                        "0116" => "食用菌菇類栽培業",
                                                        "0117" => "甘蔗栽培業",
                                                        "0118" => "花卉栽培業",
                                                        "0119" => "其他農藝及園藝業",
                                                        "0121" => "牛飼育業",
                                                        "0122" => "豬飼育業",
                                                        "0123" => "雞飼育業",
                                                        "0124" => "鴨飼育業",
                                                        "0129" => "其他畜牧業",
                                                        "0131" => "作物栽培服務業",
                                                        "0132" => "農產品整理業",
                                                        "0133" => "園藝服務業",
                                                        "0134" => "畜牧服務業",
                                                        "0139" => "其他農事服務業",
                                                        "0211" => "造林業",
                                                        "0212" => "特殊林木經營業",
                                                        "0221" => "伐木業",
                                                        "0222" => "薪炭業",
                                                        "0223" => "野生物採捕業",
                                                        "0311" => "遠洋漁業",
                                                        "0312" => "近海漁業",
                                                        "0313" => "沿岸漁業",
                                                        "0314" => "內陸漁撈業",
                                                        "0321" => "海面養殖業",
                                                        "0322" => "內陸養殖業",
                                                        "0329" => "其他水產養殖業"
                                                    )
                                    ),
                            "B" => array(
                                        "name" => "礦業及土石採取業",
                                        "data" => array(
                                                        "0411" => "石油及天然氣礦業",
                                                        "0412" => "地熱礦業",
                                                        "0420" => "煤礦業",
                                                        "0510" => "金屬礦業",
                                                        "0521" => "鹽業",
                                                        "0522" => "土礦業",
                                                        "0523" => "石礦業",
                                                        "0529" => "其他非金屬礦業",
                                                        "0611" => "陸上採土業",
                                                        "0612" => "陸上採石業",
                                                        "0621" => "河川砂礫採取業",
                                                        "0622" => "濱海及海域砂礫採取業",
                                                        "0690" => "其他土石採取業"
                                                    )
                                    ),
                            "C" => array(
                                        "name" => "製造業",
                                        "data" => array(
                                                        "0810" => "屠宰業",
                                                        "0820" => "乳品製造業",
                                                        "0831" => "罐頭食品製造業",
                                                        "0832" => "冷凍食品製造業",
                                                        "0833" => "脫水食品製造業",
                                                        "0834" => "醃漬食品製造業",
                                                        "0841" => "糖果製造業",
                                                        "0842" => "烘焙炊蒸食品製造業",
                                                        "0851" => "食用油脂製造業",
                                                        "0852" => "製粉業",
                                                        "0853" => "碾榖業",
                                                        "0861" => "砂糖製造業",
                                                        "0869" => "其他糖類製造業",
                                                        "0871" => "味精製造業",
                                                        "0872" => "食用鹽製造業",
                                                        "0873" => "醬油製造業",
                                                        "0874" => "調味醬製造業",
                                                        "0875" => "食用醋製造業",
                                                        "0879" => "其他調味品製造業",
                                                        "0881" => "酒類釀造配製業",
                                                        "0882" => "啤酒製造業",
                                                        "0883" => "非酒精飲料製造業",
                                                        "0891" => "麵條、粉條類食品製造業",
                                                        "0892" => "飼料配製業",
                                                        "0893" => "製茶業",
                                                        "0894" => "豆類加工食品製造業",
                                                        "0895" => "即食餐食製造業",
                                                        "0899" => "未分類其他食品製造業",
                                                        "0900" => "菸草製造業",
                                                        "1011" => "棉紡紗業",
                                                        "1012" => "毛紡紗業",
                                                        "1013" => "人造纖維紡紗業",
                                                        "1014" => "人造纖維加工絲業",
                                                        "1019" => "其他紡紗業",
                                                        "1021" => "棉梭織布業",
                                                        "1022" => "毛梭織布業",
                                                        "1023" => "人造纖維梭織布業",
                                                        "1024" => "針織布業",
                                                        "1029" => "其他織布業",
                                                        "1030" => "不織布業",
                                                        "1041" => "繩、纜、網製造業",
                                                        "1042" => "氈、毯製造業",
                                                        "1043" => "漁網製造業",
                                                        "1050" => "印染整理業",
                                                        "1090" => "其他紡織業",
                                                        "1111" => "梭織外衣製造業",
                                                        "1112" => "梭織內衣及睡衣製造業",
                                                        "1121" => "針織外衣製造業",
                                                        "1122" => "針織內衣及睡衣製造業  ",
                                                        "1130" => "紡織帽製造業",
                                                        "1141" => "襪類製造業",
                                                        "1142" => "紡織手套製造業  ",
                                                        "1149" => "其他服飾品製造業  ",
                                                        "1191" => "毛巾製造業",
                                                        "1199" => "未分類其他紡織製品製造業",
                                                        "1201" => "皮革、毛皮整製業",
                                                        "1202" => "鞋類製造業",
                                                        "1203" => "行李箱及手提袋製造業",
                                                        "1209" => "其他皮革、毛皮製品製造業",
                                                        "1301" => "製材業",
                                                        "1302" => "合板製造業",
                                                        "1303" => "組合木材製造業",
                                                        "1304" => "木質容器製造業",
                                                        "1305" => "竹、藤製品製造業",
                                                        "1309" => "其他木製品製造業  ",
                                                        "1411" => "木製家具及裝設品製造業",
                                                        "1412" => "竹、藤製家具及裝設品製造業",
                                                        "1419" => "其他非金屬家具及裝設品製造業",
                                                        "1420" => "金屬家具及裝設品製造業",
                                                        "1430" => "家具及裝設品表面塗裝業",
                                                        "1510" => "紙漿製造業",
                                                        "1521" => "紙張製造業",
                                                        "1522" => "紙板製造業",
                                                        "1530" => "加工紙製造業",
                                                        "1540" => "紙容器製造業",
                                                        "1591" => "家庭及衛生用紙製造業",
                                                        "1599" => "未分類其他紙製品製造業",
                                                        "1610" => "製版業",
                                                        "1620" => "印刷業",
                                                        "1630" => "印刷品裝訂及加工業",
                                                        "1690" => "其他印刷輔助業",
                                                        "1711" => "基本化學工業",
                                                        "1712" => "石油化工原料製造業",
                                                        "1713" => "肥料製造業",
                                                        "1720" => "人造纖維製造業",
                                                        "1731" => "合成樹脂及塑膠製造業",
                                                        "1732" => "合成橡膠製造業",
                                                        "1790" => "其他化學材料製造業",
                                                        "1810" => "塗料、染料及顏料製造業",
                                                        "1821" => "原料藥製造業",
                                                        "1822" => "西藥製造業",
                                                        "1823" => "生物藥品製造業",
                                                        "1824" => "中藥製造業",
                                                        "1825" => "體外檢驗試劑製造業",
                                                        "1826" => "農藥及環境衛生用藥製造業",
                                                        "1830" => "清潔用品製造業",
                                                        "1840" => "化粧品製造業",
                                                        "1890" => "其他化學製品製造業",
                                                        "1910" => "石油煉製業",
                                                        "1990" => "其他石油及煤製品製造業",
                                                        "2001" => "輪胎製造業",
                                                        "2002" => "工業用橡膠製品製造業",
                                                        "2009" => "其他橡膠製品製造業",
                                                        "2101" => "塑膠皮、板、管材製造業",
                                                        "2102" => "塑膠膜袋製造業",
                                                        "2103" => "塑膠日用品製造業",
                                                        "2104" => "塑膠皮製品製造業",
                                                        "2105" => "工業用塑膠製品製造業",
                                                        "2106" => "強化塑膠製品製造業",
                                                        "2109" => "其他塑膠製品製造業",
                                                        "2211" => "陶瓷衛浴設備製造業",
                                                        "2212" => "陶瓷餐具製造業",
                                                        "2213" => "陶瓷藝術品製造業",
                                                        "2214" => "陶瓷建材製造業",
                                                        "2215" => "科學用、工業用陶瓷製品製造業",
                                                        "2219" => "其他陶瓷製品製造業",
                                                        "2221" => "平板玻璃及其製品製造業",
                                                        "2222" => "玻璃容器製造業",
                                                        "2223" => "玻璃纖維製品製造業",
                                                        "2229" => "其他玻璃及玻璃製品製造業",
                                                        "2231" => "水泥製造業",
                                                        "2232" => "預拌混凝土製造業",
                                                        "2233" => "水泥製品製造業",
                                                        "2240" => "耐火材料製造業",
                                                        "2250" => "石材製品製造業",
                                                        "2291" => "建築用黏土製品製造業",
                                                        "2292" => "工業及研磨材料製造業",
                                                        "2293" => "石灰製造業",
                                                        "2294" => "石膏製品製造業",
                                                        "2299" => "未分類其他非金屬礦物製品製造業",
                                                        "2311" => "鋼鐵冶鍊業",
                                                        "2312" => "鋼鐵鑄造業",
                                                        "2313" => "鋼鐵軋延及擠型業",
                                                        "2314" => "鋼線鋼纜製造業",
                                                        "2315" => "廢車船解體及廢鋼鐵處理業",
                                                        "2319" => "其他鋼鐵基本工業",
                                                        "2321" => "鍊鋁業",
                                                        "2322" => "鋁鑄造業",
                                                        "2323" => "鋁材軋延、伸線、擠型業",
                                                        "2331" => "鍊銅業",
                                                        "2332" => "銅鑄造業",
                                                        "2333" => "銅材軋延、伸線、擠型業",
                                                        "2341" => "鍊鎂業",
                                                        "2342" => "鎂鑄造業",
                                                        "2343" => "鎂材軋延、伸線、擠型業",
                                                        "2390" => "其他金屬基本工業",
                                                        "2411" => "金屬鍛造業",
                                                        "2412" => "粉末冶金業",
                                                        "2420" => "金屬手工具製造業",
                                                        "2431" => "金屬結構製造業",
                                                        "2432" => "金屬建築組件製造業",
                                                        "2441" => "金屬貯槽及運輸容器製造業",
                                                        "2442" => "金屬小型容器製造業",
                                                        "2451" => "金屬表面處理業",
                                                        "2452" => "金屬熱處理業",
                                                        "2491" => "螺絲、螺帽及鉚釘製造業",
                                                        "2492" => "閥類製造業",
                                                        "2493" => "金屬彈簧製造業",
                                                        "2494" => "金屬線製品製造業",
                                                        "2499" => "未分類其他金屬製品製造業",
                                                        "2511" => "鍋爐製造修配業",
                                                        "2512" => "原動機製造修配業",
                                                        "2520" => "農業及園藝機械製造修配業",
                                                        "2531" => "金屬切削工具機製造修配業",
                                                        "2532" => "金屬成型工具機製造修配業",
                                                        "2533" => "金屬機械手工具製造修配業",
                                                        "2534" => "非傳統加工設備製造修配業",
                                                        "2539" => "其他金屬加工用機械製造修配業",
                                                        "2541" => "食品飲料機械製造修配業",
                                                        "2542" => "紡織及成衣機械製造修配業",
                                                        "2543" => "木工機械製造修配業",
                                                        "2544" => "造紙機械製造修配業",
                                                        "2545" => "印刷機械製造修配業",
                                                        "2546" => "化工機械製造修配業",
                                                        "2547" => "塑膠、橡膠機械製造修配業",
                                                        "2548" => "電子及半導體生產設備製造修配業",
                                                        "2549" => "其他專用生產機械製造修配業",
                                                        "2551" => "建築機械設備製造修配業",
                                                        "2552" => "礦業機械設備製造修配業",
                                                        "2560" => "事務機器製造業",
                                                        "2570" => "污染防治設備製造修配業",
                                                        "2581" => "空氣壓縮機及泵製造修配業",
                                                        "2582" => "液壓、氣壓傳動零組件製造修配業",
                                                        "2583" => "軸承、齒輪及動力傳動裝置製造修配業",
                                                        "2584" => "包裝機械製造修配業",
                                                        "2585" => "輸送機械設備製造修配業",
                                                        "2591" => "飲用水設備製造修配業",
                                                        "2592" => "金屬模具製造業",
                                                        "2599" => "未分類其他機械製造修配業",
                                                        "2611" => "電腦製造業",
                                                        "2612" => "電腦終端裝置製造業",
                                                        "2613" => "電腦週邊設備製造業",
                                                        "2614" => "電腦組件製造業",
                                                        "2619" => "其他電腦設備製造業",
                                                        "2621" => "有線通信機械器材製造業",
                                                        "2622" => "無線通信機械器材製造業",
                                                        "2631" => "電視機、錄放影機製造業",
                                                        "2632" => "電唱機、收錄音機製造業",
                                                        "2639" => "其他視聽電子產品製造業",
                                                        "2640" => "資料儲存媒體製造及複製業",
                                                        "2710" => "半導體製造業",
                                                        "2720" => "被動電子元件製造業",
                                                        "2730" => "印刷電路板製造業",
                                                        "2791" => "電子管製造業",
                                                        "2792" => "光電材料及元件製造業",
                                                        "2799" => "未分類其他電子零組件製造業",
                                                        "2811" => "發電、輸電、配電機械製造修配業",
                                                        "2812" => "電線及電纜製造業",
                                                        "2821" => "冷凍空調器具製造業",
                                                        "2822" => "洗衣設備製造業",
                                                        "2823" => "電熱器具製造業",
                                                        "2824" => "電扇製造業",
                                                        "2829" => "其他家用電器製造業",
                                                        "2831" => "電燈泡及燈管製造業",
                                                        "2832" => "照明器具製造業",
                                                        "2840" => "電池製造業",
                                                        "2890" => "其他電力器材製造業",
                                                        "2911" => "船舶建造修配業",
                                                        "2912" => "船舶機械及零件製造業",
                                                        "2913" => "海上結構物建造修配業",
                                                        "2921" => "軌道車輛製造修配業",
                                                        "2922" => "軌道車輛零件製造業",
                                                        "2931" => "汽車製造業",
                                                        "2932" => "汽車零件製造業",
                                                        "2941" => "機車製造業",
                                                        "2942" => "機車零件製造業",
                                                        "2951" => "自行車製造業",
                                                        "2952" => "自行車零件製造業",
                                                        "2961" => "航空器製造修配業",
                                                        "2962" => "航空器零件製造業",
                                                        "2990" => "其他運輸工具及零件製造修配業",
                                                        "3011" => "量測儀器及控制設備製造業",
                                                        "3019" => "其他精密儀器製造業",
                                                        "3021" => "照相及攝影器材製造業",
                                                        "3022" => "眼鏡及透鏡片製造業",
                                                        "3029" => "其他光學器材製造業",
                                                        "3030" => "醫療器材及設備製造業",
                                                        "3040" => "鐘錶製造業",
                                                        "3111" => "體育用品製造業",
                                                        "3112" => "玩具製造業",
                                                        "3113" => "樂器製造業",
                                                        "3114" => "文具製造業",
                                                        "3191" => "珠寶及貴金屬製品製造業",
                                                        "3192" => "拉鍊及鈕扣製造業",
                                                        "3199" => "未分類其他工業製品製造業",
                                                    )
                                    ),
                            "D" => array(
                                        "name" => "水電燃氣業",
                                        "data" => array(
                                                        "3300" => "電力供應業",
                                                        "3400" => "氣體燃料供應業",
                                                        "3500" => "熱能供應業",
                                                        "3600" => "用水供應業"
                                                    )
                                    ),
                            "E" => array(
                                        "name" => "營造業",
                                        "data" => array(
                                                        "3801" => "一般土木工程業",
                                                        "3802" => "道路工程業",
                                                        "3803" => "景觀工程業",
                                                        "3804" => "環境保護工程業",
                                                        "3901" => "房屋建築工程業",
                                                        "3902" => "房屋設備安裝工程業",
                                                        "4001" => "機電、電信及電路工程業",
                                                        "4002" => "管道工程業",
                                                        "4003" => "冷凍、通風及空調工程業",
                                                        "4100" => "建物裝修及裝潢業",
                                                        "4200" => "其他營造業"
                                                    )
                                    ),
                            "F" => array(
                                        "name" => "批發及零售業",
                                        "data" => array(
                                                        "4411" => "米糧批發業",
                                                        "4412" => "蔬果批發業",
                                                        "4413" => "花卉批發業",
                                                        "4414" => "家畜批發業",
                                                        "4415" => "家禽批發業",
                                                        "4416" => "水產品批發業",
                                                        "4419" => "其他農畜水產品批發業",
                                                        "4421" => "冷凍調理食品批發業",
                                                        "4422" => "食用油脂批發業",
                                                        "4423" => "菸酒批發業",
                                                        "4424" => "非酒精飲料批發業",
                                                        "4425" => "茶葉批發業",
                                                        "4429" => "其他食品什貨批發業",
                                                        "4431" => "布疋批發業",
                                                        "4432" => "成衣批發業",
                                                        "4433" => "鞋類批發業",
                                                        "4434" => "行李箱及手提袋批發業",
                                                        "4435" => "服飾配件批發業",
                                                        "4439" => "其他衣著、服飾品批發業",
                                                        "4441" => "家庭電器批發業",
                                                        "4442" => "家具批發業",
                                                        "4443" => "寢具批發業",
                                                        "4444" => "室內裝設品批發業",
                                                        "4445" => "攝影器材批發業",
                                                        "4449" => "其他家庭設備及用品批發業",
                                                        "4451" => "藥品及醫療用品批發業",
                                                        "4452" => "化粧品批發業",
                                                        "4453" => "清潔用品批發業",
                                                        "4461" => "書籍、文具批發業",
                                                        "4462" => "運動用品、器材批發業",
                                                        "4463" => "玩具、娛樂用品批發業",
                                                        "4464" => "樂器批發業",
                                                        "4470" => "鐘錶、眼鏡批發業",
                                                        "4480" => "首飾及貴金屬批發業",
                                                        "4511" => "木製建材批發業",
                                                        "4512" => "磚瓦、砂石、水泥及其製品批發業",
                                                        "4513" => "磁磚、貼面石材、衛浴設備批發業",
                                                        "4514" => "板玻璃批發業",
                                                        "4515" => "漆料、塗料批發業",
                                                        "4516" => "金屬建材批發業",
                                                        "4519" => "其他建材批發業",
                                                        "4521" => "化學原料批發業",
                                                        "4522" => "化學製品批發業",
                                                        "4531" => "石油製品燃料批發業",
                                                        "4539" => "其他燃料批發業",
                                                        "4541" => "機械批發業",
                                                        "4542" => "電力電子設備批發業",
                                                        "4543" => "事務機器批發業",
                                                        "4544" => "電腦及其週邊設備、軟體批發業",
                                                        "4545" => "精密儀器批發業",
                                                        "4549" => "其他機械器具批發業",
                                                        "4551" => "汽車批發業",
                                                        "4552" => "機車批發業",
                                                        "4553" => "汽機車零配件、用品批發業",
                                                        "4554" => "汽機車車胎批發業",
                                                        "4560" => "綜合商品批發業",
                                                        "4570" => "商品經紀業",
                                                        "4591" => "飼料批發業",
                                                        "4592" => "回收物料批發業",
                                                        "4599" => "未分類其他批發業",
                                                        "4611" => "米糧零售業",
                                                        "4612" => "蔬果零售業",
                                                        "4613" => "花卉零售業",
                                                        "4614" => "肉類零售業",
                                                        "4615" => "水產品零售業",
                                                        "4619" => "其他農畜水產品零售業",
                                                        "4620" => "食品什貨零售業",
                                                        "4631" => "布疋零售業",
                                                        "4632" => "成衣零售業",
                                                        "4633" => "鞋類零售業",
                                                        "4634" => "行李箱及手提袋零售業",
                                                        "4635" => "服飾配件零售業",
                                                        "4639" => "其他衣著、服飾品零售業",
                                                        "4641" => "家庭電器零售業",
                                                        "4642" => "家具零售業",
                                                        "4643" => "寢具零售業",
                                                        "4644" => "室內裝設品零售業",
                                                        "4645" => "攝影器材零售業",
                                                        "4649" => "其他家庭設備及用品零售業",
                                                        "4651" => "藥品及醫療用品零售業",
                                                        "4652" => "化粧品零售業",
                                                        "4653" => "清潔用品零售業",
                                                        "4661" => "書籍、文具零售業",
                                                        "4662" => "運動用品、器材零售業",
                                                        "4663" => "玩具、娛樂用品零售業",
                                                        "4664" => "樂器零售業",
                                                        "4670" => "鐘錶、眼鏡零售業",
                                                        "4680" => "首飾及貴金屬零售業",
                                                        "4711" => "漆料、塗料零售業",
                                                        "4719" => "其他建材零售業",
                                                        "4721" => "加油站業",
                                                        "4729" => "其他燃料零售業",
                                                        "4731" => "電腦及其週邊設備、軟體零售業",
                                                        "4732" => "精密儀器零售業",
                                                        "4739" => "其他機械器具零售業",
                                                        "4741" => "汽車零售業",
                                                        "4742" => "機車零售業",
                                                        "4743" => "汽機車零配件、用品零售業",
                                                        "4744" => "汽機車車胎零售業",
                                                        "4751" => "百貨公司業",
                                                        "4752" => "超級市場業",
                                                        "4753" => "連鎖式便利商店業",
                                                        "4754" => "零售式量販業",
                                                        "4759" => "其他綜合商品零售業",
                                                        "4791" => "中古商品零售業",
                                                        "4799" => "未分類其他零售業",
                                                        "4811" => "電子購物及郵購業",
                                                        "4812" => "直銷業",
                                                        "4819" => "其他無店面零售業"
                                                    )
                                    ),
                            "G" => array(
                                        "name" => "住宿及餐飲業",
                                        "data" => array(
                                                        "5011" => "觀光旅館業",
                                                        "5012" => "一般旅館業",
                                                        "5090" => "其他住宿服務業",
                                                        "5110" => "餐館業",
                                                        "5120" => "飲料店業",
                                                        "5191" => "飲酒店、啤酒屋",
                                                        "5199" => "未分類其他餐飲業"
                                                    )
                                    ),
                            "H" => array(
                                        "name" => "運輸、倉儲及通信業",
                                        "data" => array(
                                                        "5310" => "鐵路運輸業",
                                                        "5320" => "大眾捷運系統運輸業",
                                                        "5331" => "公共汽車客運業",
                                                        "5332" => "計程車客運業",
                                                        "5333" => "一般汽車客運業",
                                                        "5340" => "汽車貨運業",
                                                        "5390" => "其他陸上運輸業",
                                                        "5410" => "海洋水運業",
                                                        "5420" => "內河及湖泊水運業",
                                                        "5510" => "民用航空運輸業",
                                                        "5520" => "普通航空業",
                                                        "5600" => "儲配運輸物流業",
                                                        "5710" => "旅行業",
                                                        "5720" => "報關業",
                                                        "5730" => "船務代理業",
                                                        "5741" => "陸上貨運承攬業",
                                                        "5742" => "海洋貨運承攬業",
                                                        "5743" => "航空貨運承攬業",
                                                        "5750" => "陸上運輸輔助業",
                                                        "5761" => "港埠業",
                                                        "5769" => "其他水上運輸輔助業",
                                                        "5770" => "航空運輸輔助業",
                                                        "5790" => "其他運輸輔助業",
                                                        "5801" => "普通倉儲業",
                                                        "5802" => "冷凍冷藏倉儲業",
                                                        "5910" => "郵政業",
                                                        "5920" => "快遞服務業",
                                                        "6000" => "電信業"
                                                    )
                                    ),
                            "I" => array(
                                        "name" => "金融及保險業",
                                        "data" => array(
                                                        "6211" => "中央銀行",
                                                        "6212" => "本國銀行業",
                                                        "6213" => "外國銀行業",
                                                        "6220" => "信用合作社業",
                                                        "6230" => "農會、漁會信用部",
                                                        "6240" => "信託投資業",
                                                        "6250" => "郵政儲金匯兌業",
                                                        "6291" => "票券金融業",
                                                        "6292" => "典當業",
                                                        "6293" => "信用卡業",
                                                        "6294" => "金融投資業",
                                                        "6295" => "民間融資業",
                                                        "6296" => "融資性租賃業",
                                                        "6299" => "未分類其他金融及輔助業",
                                                        "6311" => "證券商",
                                                        "6312" => "證券投資顧問業",
                                                        "6313" => "證券投資信託業",
                                                        "6314" => "證券金融業",
                                                        "6319" => "其他證券業",
                                                        "6321" => "期貨商",
                                                        "6329" => "其他期貨業",
                                                        "6410" => "人身保險業",
                                                        "6420" => "財產保險業",
                                                        "6430" => "社會保險業",
                                                        "6440" => "再保險業",
                                                        "6450" => "保險輔助業",
                                                        "6490" => "其他保險業"
                                                    )
                                    ),
                            "J" => array(
                                        "name" => "不動產及租賃業",
                                        "data" => array(
                                                        "6611" => "不動產投資業",
                                                        "6612" => "不動產經紀業",
                                                        "6691" => "不動產管理業",
                                                        "6699" => "未分類其他不動產業",
                                                        "6711" => "產業用機械設備租賃業",
                                                        "6712" => "營造用機械設備租賃業",
                                                        "6713" => "事務用機械設備租賃業",
                                                        "6714" => "電腦及週邊設備租賃業",
                                                        "6719" => "其他機械設備租賃業",
                                                        "6721" => "汽車租賃業",
                                                        "6722" => "船舶租賃業",
                                                        "6723" => "貨櫃租賃業",
                                                        "6729" => "其他運輸工具設備租賃業",
                                                        "6731" => "運動及娛樂用品租賃業",
                                                        "6732" => "影片及錄影節目帶租賃業",
                                                        "6739" => "其他物品租賃業"
                                                    )
                                    ),
                            "K" => array(
                                        "name" => "專業、科學及技術服務業",
                                        "data" => array(
                                                        "6911" => "律師業",
                                                        "6912" => "代書事務服務業",
                                                        "6919" => "其他法律服務業",
                                                        "6920" => "會計服務業",
                                                        "7000" => "建築及工程技術服務業",
                                                        "7101" => "室內設計業",
                                                        "7102" => "積體電路設計業",
                                                        "7109" => "其他專門設計服務業",
                                                        "7201" => "電腦軟體服務業",
                                                        "7202" => "電腦系統整合服務業",
                                                        "7209" => "其他電腦系統設計服務業",
                                                        "7310" => "資料處理服務業",
                                                        "7321" => "網路資訊供應業",
                                                        "7322" => "新聞供應業",
                                                        "7329" => "其他資訊供應服務業",
                                                        "7401" => "投資顧問業",
                                                        "7402" => "管理顧問業",
                                                        "7403" => "環境顧問業",
                                                        "7409" => "其他顧問服務業",
                                                        "7510" => "自然科學研究發展服務業",
                                                        "7520" => "社會及人文科學研究發展服務業",
                                                        "7530" => "綜合研究發展服務業",
                                                        "7601" => "一般廣告業",
                                                        "7602" => "戶外廣告業",
                                                        "7609" => "其他廣告業",
                                                        "7701" => "市場研究及民意調查業",
                                                        "7702" => "攝影業",
                                                        "7703" => "翻譯服務業",
                                                        "7704" => "獸醫服務業",
                                                        "7705" => "環境檢測服務業",
                                                        "7709" => "未分類其他專業、科學及技術服務業"
                                                    )
                                    ),
                            "L" => array(
                                        "name" => "教育服務業",
                                        "data" => array(
                                                        "7910" => "學前教育事業",
                                                        "7920" => "小學",
                                                        "7930" => "中學",
                                                        "7940" => "職業學校",
                                                        "7950" => "大專校院",
                                                        "7960" => "特殊教育事業",
                                                        "7990" => "其他教育服務業"
                                                    )
                                    ),
                            "M" => array(
                                        "name" => "醫療保健及社會福利服務業",
                                        "data" => array(
                                                        "8110" => "醫院",
                                                        "8120" => "診所",
                                                        "8191" => "衛生所及衛生室",
                                                        "8192" => "醫事技術業",
                                                        "8193" => "助產業",
                                                        "8199" => "未分類其他醫療保健服務業",
                                                        "8201" => "兒童及少年福利服務業",
                                                        "8202" => "老人福利服務業",
                                                        "8203" => "身心障礙者福利服務業",
                                                        "8204" => "婦女福利服務業",
                                                        "8209" => "其他社會福利服務業"
                                                    )
                                    ),
                            "N" => array(
                                        "name" => "文化、運動及休閒服務業",
                                        "data" => array(
                                                        "8410" => "新聞出版業",
                                                        "8420" => "雜誌〈期刊〉出版業",
                                                        "8430" => "書籍出版業",
                                                        "8491" => "有聲出版業",
                                                        "8492" => "軟體出版業",
                                                        "8499" => "未分類其他出版業",
                                                        "8510" => "電影片製作業",
                                                        "8520" => "電影片發行業",
                                                        "8530" => "電影片映演業",
                                                        "8540" => "電影輔助業",
                                                        "8610" => "廣播業",
                                                        "8620" => "電視業",
                                                        "8630" => "廣播電視節目供應業",
                                                        "8710" => "技藝表演業",
                                                        "8720" => "文學及藝術業",
                                                        "8730" => "藝文服務業",
                                                        "8741" => "職業運動業",
                                                        "8742" => "運動場館業",
                                                        "8749" => "其他運動服務業",
                                                        "8750" => "藝人及模特兒等經紀業",
                                                        "8800" => "圖書館及檔案保存業",
                                                        "8900" => "博物館、歷史遺址及類似機構",
                                                        "9001" => "遊樂園業",
                                                        "9002" => "視聽及視唱業",
                                                        "9003" => "特殊娛樂業",
                                                        "9004" => "電子遊戲場業",
                                                        "9009" => "其他休閒服務業"
                                                    )
                                    ),
                            "O" => array(
                                        "name" => "其他服務業",
                                        "data" => array(
                                                        "9201" => "人力供應業",
                                                        "9202" => "保全服務業",
                                                        "9203" => "徵信服務業",
                                                        "9204" => "建築物清潔服務業",
                                                        "9205" => "病媒防治業",
                                                        "9206" => "影印業",
                                                        "9209" => "其他支援服務業",
                                                        "9301" => "廢棄物清除業",
                                                        "9302" => "廢棄物處理業",
                                                        "9303" => "廢〈污〉水處理業",
                                                        "9309" => "其他環境衛生及污染防治服務業",
                                                        "9410" => "宗教組織",
                                                        "9421" => "工商業團體",
                                                        "9422" => "自由職業團體",
                                                        "9423" => "勞工團體",
                                                        "9424" => "農民團體",
                                                        "9491" => "政治團體",
                                                        "9499" => "未分類其他組織",
                                                        "9511" => "汽車維修業",
                                                        "9512" => "汽車美容業",
                                                        "9591" => "電器及電子產品修理業",
                                                        "9592" => "機車修理業",
                                                        "9599" => "未分類其他器物修理業",
                                                        "9610" => "洗衣業",
                                                        "9620" => "理髮及美容業",
                                                        "9630" => "殯葬服務業",
                                                        "9640" => "停車場業",
                                                        "9650" => "家事服務業",
                                                        "9691" => "相片沖洗業",
                                                        "9692" => "浴室業",
                                                        "9693" => "裁縫業",
                                                        "9699" => "未分類其他個人服務業"
                                                    )
                                    ),
                            "P" => array(
                                        "name" => "公共行政業",
                                        "data" => array(
                                                        "9811" => "政府機關",
                                                        "9812" => "民意機關",
                                                        "9820" => "國防事業",
                                                        "9901" => "國際組織",
                                                        "9902" => "外國使領館",
                                                        "9909" => "其他外國機構"
                                                    )
                                    )
                        );

        foreach ($store_type as $key => $row) 
        {

            $parents_id = DB::table($this->option_table)->insertGetId(
                array(
                    'type'          => 1,
                    'key'           => $key,
                    'value'         => $row["name"],
                    'parents_id'    => 0,
                    'status'        => 1,
                    'created_at'    => date("Y-m-d H:i:s"),
                    'updated_at'    => date("Y-m-d H:i:s")
                )
            );   
        
            foreach ($row["data"] as $code => $value) 
            {

                DB::table($this->option_table)->insert(
                    array(
                        'type'          => 1,
                        'key'           => $code,
                        'value'         => $value,
                        'parents_id'    => $parents_id,
                        'status'        => 1,
                        'created_at'    => date("Y-m-d H:i:s"),
                        'updated_at'    => date("Y-m-d H:i:s")
                    )
                );   

            }

        }

        // role
        DB::table($this->role_table)->insert(
            array(
                'name'          => '管理者',
                'status'        => 1,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );

        DB::table($this->role_table)->insert(
            array(
                'name'          => '店鋪管理者',
                'status'        => 1,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );

        // service
        DB::table($this->service_table)->insert(
            array(
                'name'          => '首頁',
                'link'          => '/index',
                'parents_id'    => 0,
                'status'        => 1,
                'public'        => 4,
                'sort'          => 1,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );

        $sub_admin_service_id = array();


        $user_service_id = DB::table($this->service_table)->insertGetId(
                                array(
                                    'name'          => '使用者管理',
                                    'link'          => '',
                                    'parents_id'    => 0,
                                    'status'        => 1,
                                    'public'        => 4,
                                    'sort'          => 2,
                                    'created_at'    => date("Y-m-d H:i:s"),
                                    'updated_at'    => date("Y-m-d H:i:s")
                                )
                            );
        $sub_admin_service_id[] = $user_service_id;
        $sub_admin_service_id[] = DB::table($this->service_table)->insertGetId(
                                array(
                                    'name'          => '使用者新增',
                                    'link'          => '/user/create',
                                    'parents_id'    => $user_service_id,
                                    'status'        => 1,
                                    'public'        => 4,
                                    'sort'          => 3,
                                    'created_at'    => date("Y-m-d H:i:s"),
                                    'updated_at'    => date("Y-m-d H:i:s")
                                )
                            );
        $sub_admin_service_id[] = DB::table($this->service_table)->insertGetId(
                                    array(
                                        'name'          => '使用者列表',
                                        'link'          => '/user',
                                        'parents_id'    => $user_service_id,
                                        'status'        => 1,
                                        'public'        => 4,
                                        'sort'          => 4,
                                        'created_at'    => date("Y-m-d H:i:s"),
                                        'updated_at'    => date("Y-m-d H:i:s")
                                    )
                                );
        $sub_admin_service_id[] = DB::table($this->service_table)->insertGetId(
                                    array(
                                        'name'          => '照片上傳',
                                        'link'          => '/photo',
                                        'parents_id'    => $user_service_id,
                                        'status'        => 1,
                                        'public'        => 4,
                                        'sort'          => 4,
                                        'created_at'    => date("Y-m-d H:i:s"),
                                        'updated_at'    => date("Y-m-d H:i:s")
                                    )
                                );
        $role_service_id = DB::table($this->service_table)->insertGetId(
                                array(
                                    'name'          => '角色管理',
                                    'link'          => '',
                                    'parents_id'    => 0,
                                    'status'        => 1,
                                    'public'        => 3,
                                    'sort'          => 5,
                                    'created_at'    => date("Y-m-d H:i:s"),
                                    'updated_at'    => date("Y-m-d H:i:s")
                                )
                            );
        DB::table($this->service_table)->insertGetId(
            array(
                'name'          => '角色新增',
                'link'          => '/role/create',
                'parents_id'    => $role_service_id,
                'status'        => 1,
                'public'        => 3,
                'sort'          => 6,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );
        DB::table($this->service_table)->insertGetId(
            array(
                'name'          => '角色列表',
                'link'          => '/role',
                'parents_id'    => $role_service_id,
                'status'        => 1,
                'public'        => 3,
                'sort'          => 7,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );
        $service_id = DB::table($this->service_table)->insertGetId(
                            array(
                                'name'          => '服務管理',
                                'link'          => '',
                                'parents_id'    => 0,
                                'status'        => 1,
                                'public'        => 3,
                                'sort'          => 8,
                                'created_at'    => date("Y-m-d H:i:s"),
                                'updated_at'    => date("Y-m-d H:i:s")
                            )
                        );
        DB::table($this->service_table)->insertGetId(
            array(
                'name'          => '服務新增',
                'link'          => '/service/create',
                'parents_id'    => $service_id,
                'status'        => 1,
                'public'        => 3,
                'sort'          => 9,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );
        DB::table($this->service_table)->insertGetId(
            array(
                'name'          => '服務列表',
                'link'          => '/service',
                'parents_id'    => $service_id,
                'status'        => 1,
                'public'        => 3,
                'sort'          => 10,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );
        DB::table($this->service_table)->insertGetId(
            array(
                'name'          => '發佈服務',
                'link'          => '/service_public',
                'parents_id'    => $service_id,
                'status'        => 1,
                'public'        => 3,
                'sort'          => 11,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );
        $buy_service_id = DB::table($this->service_table)->insertGetId(
                                array(
                                    'name'          => 'GO商城',
                                    'link'          => '',
                                    'parents_id'    => 0,
                                    'status'        => 1,
                                    'public'        => 4,
                                    'sort'          => 12,
                                    'created_at'    => date("Y-m-d H:i:s"),
                                    'updated_at'    => date("Y-m-d H:i:s")
                                )
                            );
        $sub_admin_service_id[] = $buy_service_id;
        $sub_admin_service_id[] = DB::table($this->service_table)->insertGetId(
                                array(
                                    'name'          => '加值服務',
                                    'link'          => '/buy',
                                    'parents_id'    => $buy_service_id,
                                    'status'        => 1,
                                    'public'        => 4,
                                    'sort'          => 13,
                                    'created_at'    => date("Y-m-d H:i:s"),
                                    'updated_at'    => date("Y-m-d H:i:s")
                                )
                            );
        $sub_admin_service_id[] = DB::table($this->service_table)->insertGetId(
                                array(
                                    'name'          => '購買紀錄',
                                    'link'          => '/buy_record',
                                    'parents_id'    => $buy_service_id,
                                    'status'        => 1,
                                    'public'        => 4,
                                    'sort'          => 14,
                                    'created_at'    => date("Y-m-d H:i:s"),
                                    'updated_at'    => date("Y-m-d H:i:s")
                                )
                            );
        $store_service_id = DB::table($this->service_table)->insertGetId(
                                array(
                                    'name'          => '店鋪管理',
                                    'link'          => '',
                                    'parents_id'    => 0,
                                    'status'        => 1,
                                    'public'        => 4,
                                    'sort'          => 15,
                                    'created_at'    => date("Y-m-d H:i:s"),
                                    'updated_at'    => date("Y-m-d H:i:s")
                                )
                            );
        $sub_admin_service_id[] = $store_service_id;
        $sub_admin_service_id[] = DB::table($this->service_table)->insertGetId(
            array(
                'name'          => '新增店鋪',
                'link'          => '/store/create',
                'parents_id'    => $store_service_id,
                'status'        => 1,
                'public'        => 4,
                'sort'          => 16,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );
        $sub_admin_service_id[] = DB::table($this->service_table)->insertGetId(
            array(
                'name'          => '店鋪列表',
                'link'          => '/store',
                'parents_id'    => $store_service_id,
                'status'        => 1,
                'public'        => 4,
                'sort'          => 17,
                'created_at'    => date("Y-m-d H:i:s"),
                'updated_at'    => date("Y-m-d H:i:s")
            )
        );


        // user_role
        DB::table($this->user_role_table)->insert(
            array(
                'user_id'      => 1,
                'role_id'      => 1
            )
        );

        // role_service
        for ($i=1; $i < 18; $i++) 
        { 
            DB::table($this->role_service_table)->insert(
                array(
                    'role_id'      => 1,
                    'service_id'   => $i
                )
            );
        }

        foreach ($sub_admin_service_id as $row) 
        {
            DB::table($this->role_service_table)->insert(
                array(
                    'role_id'      => 2,
                    'service_id'   => $row
                )
            );
        }

    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists($this->user_role_table);
        Schema::dropIfExists($this->role_service_table);
        Schema::dropIfExists($this->service_user_table);
        Schema::dropIfExists($this->store_table);
        Schema::dropIfExists($this->user_table);
        Schema::dropIfExists($this->option_table);
        Schema::dropIfExists($this->role_table);
        Schema::dropIfExists($this->service_table);
    }
}
